src/DataProcessors/Оплата1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>Оплата1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.ПротоколРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>докВозврат</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.Возврат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>фБезнал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/Оплата1/Forms/Форма8/module.bsl
Перем А;
Процедура УстановитьДоступностьКнопки(ИмяКнопки, Доступность, Акцент = 0) Экспорт
	Кнопка = ЭлементыФормы[ИмяКнопки];
	Кнопка.Доступность = Доступность;
КонецПроцедуры

Процедура ПриИзмененииСуммы()
	
	Если Оплачено Тогда
		НадписьСдача = "-";
	Иначе
		НадписьСдача = Формат(Макс(Получено - Коплате, 0), "ЧДЦ=2; ЧРД=.") + " " + глСимволРубля;	
		НадписьКоплате = Формат(Макс(Коплате - Получено, 0), "ЧДЦ=2; ЧРД=.") + " " + глСимволРубля;
	КонецЕсли;
	
	Если Получено Или (Не Коплате И Не Оплачено) Тогда
		Если Оплачено Тогда
			УстановитьДоступностьОплатыКартой(Истина);
		Иначе 
			УстановитьДоступностьОплатыКартой(Ложь);
		КонецЕсли; 

		Если Получено >= Коплате Тогда    
			УстановитьДоступностьКнопки("ОК", Истина);
		КонецЕсли;
	Иначе
		Если Оплачено Тогда
			УстановитьДоступностьКнопки("ОК", Истина);
		Иначе 
			//УстановитьДоступностьКнопки("ОК", Ложь);
		КонецЕсли;                                  		
		
		УстановитьДоступностьОплатыКартой(Истина);
	КонецЕсли;
	УстановитьДоступностьКнопки("ОкСкрытая", ЭлементыФормы.ОК.Доступность);
	УстановитьДоступностьКнопки("ИтогСкрытая", ЭлементыФормы.ОК.Доступность);
КонецПроцедуры

Процедура УстановитьДоступностьОплатыКартой(Доступность)
	ЭлементыФормы.ОплатаКартой.Доступность = Доступность;
	ЭлементыФормы.ОплатаКартойСкрытая.Доступность = Доступность;
	Если Доступность Тогда
		ЭлементыФормы.ОплатаКартой.ЦветФонаКнопки = Метаданные.ЭлементыСтиля.ЦветТемы.Значение;
		ЭлементыФормы.ОплатаКартой.ЦветРамки = Метаданные.ЭлементыСтиля.ЦветТемы.Значение;
		ЭлементыФормы.ОплатаКартой.ЦветТекстаКнопки = WebЦвета.Белый;
	Иначе
		ЭлементыФормы.ОплатаКартой.ЦветФонаКнопки = Метаданные.ЭлементыСтиля.НеактивнаяКнопка.Значение;
		ЭлементыФормы.ОплатаКартой.ЦветРамки = Метаданные.ЭлементыСтиля.НеактивнаяКнопка.Значение;
		ЭлементыФормы.ОплатаКартой.ЦветТекстаКнопки = Метаданные.ЭлементыСтиля.НеактивныйЭлемент.Значение;
	КонецЕсли;
КонецПроцедуры

Процедура ДоступностьКнопок(Доступность) Экспорт
	Доступность = Не ЗначениеЗаполнено(Оплачено);
	Для Инд = 1 По 10 Цикл
	
		ЭлементыФормы["Кнопка"+(Инд%10)].Доступность = Доступность;
	
	КонецЦикла; 	
	
	ЭлементыФормы.КнопкаТочка.Доступность = Доступность;
	ЭлементыФормы.КнопкаОчистить.Доступность = Доступность;
	
КонецПроцедуры

Процедура НажатиеЦифры(Элемент)
	глОтсечкаПростоя();
	Цифра = Прав(Элемент.Имя,1);
	НадписьПолучено = СтрЗаменить(НадписьПолучено, " ","");
	НадписьПолучено = СтрЗаменить(НадписьПолучено, глСимволРубля,"");
	НадписьПолучено = СтрЗаменить(НадписьПолучено, Символы.НПП,"") + Цифра;
	былоПолучено = Получено;
	Попытка 
		Получено = Число(СтрЗаменить(НадписьПолучено, Символы.НПП, ""));
		Если былоПолучено <> Получено Тогда
			НадписьПолучено = "" + Формат(Получено,"ЧРД=.");
		КонецЕсли;
		НадписьПолучено = НадписьПолучено + " " + глСимволРубля;
		ПриИзмененииСуммы();
	Исключение
	КонецПопытки;
	Если ЭлементыФормы.ОК.Доступность И ЭлементыФормы.ОК.Видимость Тогда
		ТекущийЭлемент = ЭлементыФормы.ОК;
	Иначе
		ТекущийЭлемент = ЭлементыФормы.Пустышка;
	КонецЕсли; 
	ПодключитьОбработчикОжидания("ПроверкаСуммыПолучено",0.3,1);
КонецПроцедуры

Процедура ПроверкаСуммыПолучено() Экспорт
	Если ЗначениеЗаполнено(Получено) Тогда
		Если Получено < Товары.Итог("СуммаРеализации") Тогда
			ЭлементыФормы.НадписьПолученоМеньшеСуммыЧека.Видимость = 1;
			ЭлементыФормы.НадписьПолучено.ЦветТекста = ЦветаСтиля.Акцент;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЭлементыФормы.НадписьПолучено.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЭлементыФормы.НадписьПолученоМеньшеСуммыЧека.Видимость = 0;	
КонецПроцедуры

Процедура КнопкаТочкаНажатие(Элемент)
	глОтсечкаПростоя();
	Если Найти(НадписьПолучено,". ") Тогда
		НадписьПолучено  = СтрЗаменить(НадписьПолучено,". "," ");
	ИначеЕсли Найти(НадписьПолучено,".") Тогда
	
	Иначе
		
		НадписьПолучено = СтрЗаменить(НадписьПолучено," " + глСимволРубля, "") + ".";
		НадписьПолучено = НадписьПолучено + " " + глСимволРубля;
	КонецЕсли;
	ТекущийЭлемент = ЭлементыФормы.ОК;
КонецПроцедуры

Процедура КнопкаОчиститьНажатие(Элемент)
	глОтсечкаПростоя();
	НадписьПолучено = "0 " + глСимволРубля;
	Получено = 0;
	ПриИзмененииСуммы();
	ПроверкаСуммыПолучено();
КонецПроцедуры

Процедура ОтменаНажатие(Элемент)
	//глОтсечкаПростоя();
	//РезультатОплаты.Вставить("ОТМЕНА", Истина);
	//РезультатОплаты.Вставить("Успех", Ложь);
	//Закрыть(РезультатОплаты);
КонецПроцедуры

Процедура ОкНажатие(Элемент)
	ЗарегистрироватьСобытие("Интерактивное действия.Оплата.Печать",,,Заказ.Ссылка);
	Если фИдетОплата Тогда
		Возврат;
	КонецЕсли;
	СуммаРеализации = СуммаРеализации();
	Если Получено > СуммаРеализации * 10 и Получено > 1000000 Тогда
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "Неверно введена сумма", "Введенная сумма слишком велика для вашей ККТ.
		|Введенная сумма: " + НадписьПолучено,"","ОК","");
		Возврат;
	КонецЕсли;
	РезультатОплаты.Вставить("Сдача", НадписьСдача);
	глОтсечкаПростоя();
	ТолькоПросмотр = Истина;
	Если ЭлементыФормы.РамкаОплатаКартой.Видимость И Оплачено Тогда
		ОтменаТранзакцииПлатежнойСистемы();
	Иначе
		Если Оплачено Тогда
			Оплата();
			Закрыть(РезультатОплаты);
		ИначеЕсли Получено>=СуммаРеализации Тогда
			Оплата();
			Закрыть(РезультатОплаты);
		Иначе
			ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "Неверно введена сумма", "Введенная сумма меньше суммы чека на " + (Формат(Товары.Итог("СуммаРеализации") - Получено,"ЧДЦ=2; ЧРД=.")) + глСимволРубля,"","ОК","");
			ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	глОтсечкаПростоя();
КонецПроцедуры

Процедура ОплатаКартойНажатие(Элемент)
	ЗарегистрироватьСобытие("Интерактивное действие.Оплата.Оплата картой",,,Заказ.Ссылка);
	глОтсечкаПростоя();
	Если Получено Тогда
		Возврат;
	КонецЕсли;
	ТолькоПросмотр = Истина;
	Если Оплачено Тогда 
		ОтменаТранзакцииПлатежнойСистемы();
		Закрыть(РезультатОплаты);
	Иначе 
		Оплата();
		Закрыть(РезультатОплаты);
	КонецЕсли;
	ТолькоПросмотр = Ложь;
	глОтсечкаПростоя();
КонецПроцедуры

Процедура ПриОткрытии()
	ТолькоПросмотр = Ложь;
	Оплачено = ПротоколРасчетов.Протокол.Итог("СуммаФакт");
	Товары = Заказ.Товары;
	СуммаЧека = Товары.Итог("СуммаРеализации");
	Коплате = СуммаЧека - Оплачено;
	Если Оплачено Тогда
		Получено = Коплате;
		ЭлементыФормы.ОплатаКартой.Заголовок = "ВОЗВРАТ ДЕНЕГ НА КАРТУ";
		ЭлементыФормы.НадписьЗаказОплачен.Видимость = 1;
		//ЭлементыФормы.НадписьКоплатеКартой.Заголовок = "Оплачено картой";
		СтрокаБезнал = ПротоколРасчетов.Протокол.Найти(Справочники.ВариантыОплаты.Карта);
		Если СтрокаБезнал <> Неопределено Тогда
			НадписьКоплате = "" + СтрокаБезнал.СуммаФакт + " " + глСимволРубля;;
		КонецЕсли;
		
		СтрокаНал = ПротоколРасчетов.Протокол.Найти(Справочники.ВариантыОплаты.Наличные);
		Если СтрокаНал <> Неопределено Тогда
			НадписьПолучено = ""+СтрокаНал.СуммаФакт + " " + глСимволРубля;;
		КонецЕсли;
	Иначе		
		НадписьКоплате = Коплате;
	КонецЕсли; 
	
	НадписьСуммаЧека = Формат(СуммаЧека, "ЧДЦ=2; ЧРД=.") + " " + глСимволРубля;
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	ПриИзмененииСуммы(); 
	ДоступностьКнопок(Не Оплачено);
	Если Не ПротоколРасчетов.Протокол.Итог("СуммаФакт") Тогда
		Высота = 243;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();
КонецПроцедуры

Процедура ОтправитьНаПочтуНажатие(Элемент)
	//РаботаСокнами.AOTon(Заголовок, "off");
	Email = ИнтерфейсРМ.ВводСтроки("Введите адрес электронной почты");	
    	
	ПроверкаEmail();
	Если ЗначениеЗаполнено(Email) Тогда
		ЭлементыФормы.ОтправитьНаПочту.ЦветТекстаКнопки = Метаданные.ЭлементыСтиля.Акцент.Значение;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверкаEmail()
	RegExp = ирКэш.Получить().RegExp;
	RegExp.Pattern = "(^[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\.[a-zA-Z0-9-.]+$)";
	ЭтоEmail = RegExp.Test(Email);
	Если НЕ ЭтоEmail Тогда
		РаботаСокнами.Подсказка("Некорректный email: `n " + Email);
		Email = "";
	КонецЕсли; 
КонецПроцедуры

Процедура ОтправитьСМСНажатие(Элемент)
	
	НомерТелефона = ИнтерфейсРМ.ВводЧисла("Введите номер телефона","Строка",20,0,,,,,"8 (\999)999-99-99");
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		ЭлементыФормы.ОтправитьСМС.ЦветТекстаКнопки = Метаданные.ЭлементыСтиля.Акцент.Значение;
	КонецЕсли;	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	глОтсечкаПростоя();
	Если глСтекОкон[0].Форма <> ЭтаФорма Тогда
		Возврат;
	КонецЕсли;
	
	Email = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник,Событие,Данные);
	ПроверкаEmail();
	Если Не ЗначениеЗаполнено(Email) Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Email) Тогда
		ЭлементыФормы.ОтправитьНаПочту.ЦветТекстаКнопки = Метаданные.ЭлементыСтиля.Акцент.Значение;
		РаботаСокнами.Подсказка("Email: " + Email);
	КонецЕсли;	
	
КонецПроцедуры

Процедура Кнопка10Нажатие(Элемент)
	Если фИдетОплата Тогда
		Возврат;
	КонецЕсли;
	ОкНажатие("");	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	ОтключитьОбработчикОжидания("ОбновлениеОтображения");
	Если Оплачено Тогда
		Для Каждого Элемент Из ЭлементыФормы Цикл
			Если СтрНачинаетсяС(Элемент.Имя, "Рамка") Тогда
				Кнопка = ЭлементыФормы.Найти(СтрЗаменить(Элемент.Имя,"Рамка",""));
				Если Кнопка = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Элемент.Видимость = Кнопка = ТекущийЭлемент;
			КонецЕсли;
		КонецЦикла;	
		ПодключитьОбработчикОжидания("ОбновлениеОтображения",0.5,1);
	Иначе
		ТекущийЭлемент = ЭлементыФормы.ОК;
	КонецЕсли;
КонецПроцедуры

Процедура ПустышкаНажатие(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

НадписьПолучено = "0 " + глСимволРубля;
Получено = 0;
//РаботаСокнами.ПереназначитьКнопки("Оплата", "VKBC", "+1");
//РаботаСокнами.ПереназначитьКнопки("Оплата", ".", "{NumpadDot}");

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

//Если Не глПараметрыРМ.ОбрезкаОкон Тогда
//	Заголовок = "                                        ";
//	ЭлементыФормы.тЗаголовок.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
//	
//КонецЕсли;

ЭлементыФормы.ОтправитьНаПочту.Заголовок = Шрифты.ПолучитьСимвол("envelope_o");
ЭлементыФормы.ОтправитьСМС.Заголовок = Шрифты.ПолучитьСимвол("comment_o");

МассивИзменяющихсяЭлементов = Новый Массив;
МассивИзменяющихсяЭлементов.Добавить(ЭлементыФормы.ОК);
МассивИзменяющихсяЭлементов.Добавить(ЭлементыФормы.ОКТень);
МассивИзменяющихсяЭлементов.Добавить(ЭлементыФормы.РамкаОк);
МассивИзменяющихсяЭлементов.Добавить(ЭлементыФормы.ОплатаКартой);
МассивИзменяющихсяЭлементов.Добавить(ЭлементыФормы.ОплатаКартойТень);
МассивИзменяющихсяЭлементов.Добавить(ЭлементыФормы.РамкаОплатаКартой);
Если Не ПротоколРасчетов.Протокол.Итог("СуммаФакт") Тогда
	Для Каждого Эл Из МассивИзменяющихсяЭлементов Цикл
		Эл.Видимость = 0;
		Эл.Лево = 1;
		Эл.Верх = 1;
	КонецЦикла;
	Высота = 243;
Иначе
	ЭлементыФормы.ОплатаКартойСкрытая.Видимость = 0;
	ЭлементыФормы.ОплатаКартойСкрытая.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.Нет);
	ЭлементыФормы.ОплатаКартой.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша._1,,,Истина);
	
	ЭлементыФормы.ОкСкрытая.Видимость = 0;
	ЭлементыФормы.ОкСкрытая.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.Нет);
	ЭлементыФормы.ОК.СочетаниеКлавиш  = Новый СочетаниеКлавиш(Клавиша.F7,,,Истина);
	
	//ЭлементыФормы.ИтогСкрытая.Видимость = 0;
	ЭлементыФормы.Отмена.Видимость = 0;
	
КонецЕсли;
